"""
给定一个不含重复数字的数组 nums ，返回其 所有可能的全排列 。你可以 按任意顺序 返回答案。

示例 1：
输入：nums = [1,2,3]
输出：[[1,2,3],[1,3,2],[2,1,3],[2,3,1],[3,1,2],[3,2,1]]

示例 2：
输入：nums = [0,1]
输出：[[0,1],[1,0]]

示例 3：
输入：nums = [1]
输出：[[1]]
"""

# 最佳答案，回溯
class Solution:
    def permute(self, nums: List[int]) -> List[List[int]]:
        def dfs(x):
            if x == len(nums) - 1:
                res.append(list(nums))   # 添加排列方案
                return
            for i in range(x, len(nums)):
                nums[i], nums[x] = nums[x], nums[i]  # 交换，将 nums[i] 固定在第 x 位
                dfs(x + 1)                           # 开启固定第 x + 1 位元素
                nums[i], nums[x] = nums[x], nums[i]  # 恢复交换
        res = []
        dfs(0)
        return res

# 复杂度分析：
# 时间复杂度：O(n*n!)，其中 n 是数组的长度。全排列的数量为 n!，而每个排列需要 O(n) 的时间来构造。
# 空间复杂度：O(n)，其中 n 是数组的长度。递归调用栈的深度为 n，此外还需要 O(n) 的空间来存储当前的排列。

# 笔记：
# 回溯法 采用试错的思想，它尝试分步的去解决一个问题。
# 在分步解决问题的过程中，当它通过尝试发现现有的分步答案不能得到有效的正确的解答的时候，
# 它将取消上一步甚至是上几步的计算，再通过其它的可能的分步解答再次尝试寻找问题的答案。
# 回溯法通常用最简单的递归方法来实现，在反复重复上述的步骤后可能出现两种情况：
# 找到一个可能存在的正确的答案；
# 在尝试了所有可能的分步方法后宣告该问题没有答案。
# 深度优先搜索 算法（英语：Depth-First-Search，DFS）是一种用于遍历或搜索树或图的算法。
# 这个算法会 尽可能深 的搜索树的分支。当结点 v 的所在边都己被探寻过，
# 搜索将 回溯 到发现结点 v 的那条边的起始结点。这一过程一直进行到已发现从源结点可达的所有结点为止。
# 如果还存在未被发现的结点，则选择其中一个作为源结点并重复以上过程，整个进程反复进行直到所有结点都被访问为止。
# 回溯强调了 回退 操作对于搜索的合理性。
# 与动态规划的区别
# 共同点
# 用于求解多阶段决策问题。多阶段决策问题即：
# 求解一个问题分为很多步骤（阶段）；
# 每一个步骤（阶段）可以有多种选择。
# 不同点
# 动态规划只需要求我们评估最优解是多少，最优解对应的具体解是什么并不要求。因此很适合应用于评估一个方案的效果；
# 回溯算法可以搜索得到所有的方案（当然包括最优解），但是本质上它是一种遍历算法，时间复杂度很高。

