"""
给你一个整数 n ，返回 和为 n 的完全平方数的最少数量 。
完全平方数 是一个整数，其值等于另一个整数的平方；换句话说，
其值等于一个整数自乘的积。例如，1、4、9 和 16 都是完全平方数，而 3 和 11 不是。

示例 1：
输入：n = 12
输出：3 
解释：12 = 4 + 4 + 4

示例 2：
输入：n = 13
输出：2
解释：13 = 4 + 9
"""

# 最佳答案，动态规划
class Solution:
    def numSquares(self, n: int) -> int:
        dp = [0]*(n+1)                   # 初始化dp数组
        for i in range(1, n + 1):        # 遍历所有的数
            if i ** 0.5 % 1 == 0:        # 如果 i 是完全平方数
                dp[i] = 1                # 如果 i 是完全平方数，那么它本身就是一个完全平方数，所以最少数量为 1
            else:
                dp[i] = 1+min([dp[i-j*j] for j in range(1,int(i**0.5)+1)])   # 如果 i 不是完全平方数，那么我们可以将 i 拆分为一个完全平方数 j*j 和剩余的数 i-j*j 的和。
        return dp[-1]

# 笔记：
# 所有的数都可以表示为若干个完全平方数的和吗？
# 拉格朗日四平方数定理：每个自然数都可以表示为四个整数的平方和。

# 本题动态规划思路：
# 1. 定义子问题：子问题就是 “和为 k 的完全平方数的最少数量 ”，用 f(k) 表示。
# 2. 写出子问题的递推关系以及初始条件：
# f(k) = min{ f(k-j*j) + 1 }，其中 j 是所有小于等于 sqrt(k) 的整数。

# 复杂度分析：
# 时间复杂度 O(n*sqrt(n))，其中 n 是输入的整数。我们需要计算从 1 到 n 的每个整数的最少数量，并且对于每个整数，我们需要检查所有小于等于 sqrt(k) 的整数。
# 空间复杂度 O(n)，我们使用了一个长度为 n+1 的数组。