"""
你是一个专业的小偷，计划偷窃沿街的房屋。每间房内都藏有一定的现金，
影响你偷窃的唯一制约因素就是相邻的房屋装有相互连通的防盗系统，如果两间相邻的房屋在同一晚上被小偷闯入，
系统会自动报警。给定一个代表每个房屋存放金额的非负整数数组，计算你 不触动警报装置的情况下 ，
一夜之内能够偷窃到的最高金额。

示例 1：
输入：[1,2,3,1]
输出：4
解释：偷窃 1 号房屋 (金额 = 1) ，然后偷窃 3 号房屋 (金额 = 3)。
     偷窃到的最高金额 = 1 + 3 = 4 。

示例 2：
输入：[2,7,9,3,1]
输出：12
解释：偷窃 1 号房屋 (金额 = 2), 偷窃 3 号房屋 (金额 = 9)，接着偷窃 5 号房屋 (金额 = 1)。
     偷窃到的最高金额 = 2 + 9 + 1 = 12 。
"""

# 最佳答案，动态规划
class Solution:
    def rob(self, nums: List[int]) -> int:
    if len(nums) == 0:
        return 0

    # 子问题：
    # f(k) = 偷 [0..k) 房间中的最大金额

    # f(0) = 0
    # f(1) = nums[0]
    # f(k) = max{ rob(k-1), nums[k-1] + rob(k-2) }

    N = len(nums)      # 记录房屋的数量
    dp = [0] * (N+1)   # 初始化dp数组
    dp[0] = 0          # 初始状态
    dp[1] = nums[0]    # 初始状态
    for k in range(2, N+1):
        dp[k] = max(dp[k-1], nums[k-1] + dp[k-2])
    return dp[N]

# 复杂度分析：
# 时间复杂度 O(n)，其中 n 是数组 nums 的长度。我们只需要遍历一次数组。
# 空间复杂度 O(n)，我们使用了一个长度为 n+1 的数组。

# 笔记：小偷问题是一个很好的入门动态规划的例子。
# 通过分析问题的最优子结构，我们可以将问题分解为更小的子问题，并使用动态规划来高效地解决它。
# 动态规划的的四个解题步骤是：
# 1. 定义子问题
# 2. 写出子问题的递推关系以及初始条件
# 3. 确定 DP 数组的计算顺序
# 4. 空间优化（可选）

# 这道题的解题步骤：
# 1. 定义子问题：子问题就是 “从 k 个房子中能偷到的最大金额 ”，用 f(k) 表示。
# 要求子问题需要具备两个性质：
# 原问题要能由子问题表示
# 一个子问题的解要能通过其他子问题的解求出：f(k) 可以由 f(k−1) 和 f(k−2) 
# 本题：f(k)=max{f(k−1),Hk−1 +f(k−2)}
# 在写递推关系的时候，要注意写上 k=0 和 k=1 的基本情况。
# 确认 DP 数组的计算顺序，我们最好坚持用自底向上的 dp 数组。DP 数组也可以叫”子问题数组”
#