"""
给定一个只包括 '('，')'，'{'，'}'，'['，']' 的字符串 s ，判断字符串是否有效。

有效字符串需满足：

左括号必须用相同类型的右括号闭合。
左括号必须以正确的顺序闭合。
每个右括号都有一个对应的相同类型的左括号。

本题是「邻项消除」问题，这类问题都可以用栈解决。
"""

# 最佳答案，使用栈来解题
class Solution:
    def isValid(self, s: str) -> bool:
        if len(s) % 2:  # s 长度必须是偶数，%是取余运算符，%2==1表示奇数，%2==0表示偶数
            return False
        mp = {')': '(', ']': '[', '}': '{'}
        st = []
        for c in s:
            if c not in mp:  # c 是左括号
                st.append(c)  # 入栈
            elif not st or st.pop() != mp[c]:  # c 是右括号，先判断栈是否为空，如果为空，说明没有左括号与之匹配，返回 False；
                                               # 如果不为空，弹出栈顶元素并与当前右括号对应的左括号进行比较，如果不相等，说明括号类型不匹配，返回 False
                return False  # 没有左括号，或者左括号类型不对
        return not st  # 所有左括号必须匹配完毕

# 复杂度分析：
# 时间复杂度：O(n)，其中 n 是字符串 s 的长度。我们只需要遍历一次字符串 s。
# 空间复杂度：O(n)，最坏情况下，栈中可能会存储 n/2 个左括号，因此空间复杂度为 O(n)。

# elif是 else if 的缩写，表示如果前面的条件不满足，就判断这个条件
# pop() 方法用于移除列表中的一个元素（默认最后一个元素），并且返回该元素的值。