"""
给定一个整数数组 nums，将数组中的元素向右轮转 k 个位置，其中 k 是非负数。

示例 1:
输入: nums = [1,2,3,4,5,6,7], k = 3
输出: [5,6,7,1,2,3,4]
解释:
向右轮转 1 步: [7,1,2,3,4,5,6]
向右轮转 2 步: [6,7,1,2,3,4,5]
向右轮转 3 步: [5,6,7,1,2,3,4]

示例 2:
输入：nums = [-1,-100,3,99], k = 2
输出：[3,99,-1,-100]
解释: 
向右轮转 1 步: [99,-1,-100,3]
向右轮转 2 步: [3,99,-1,-100]
"""

# 最佳答案，三次翻转
class Solution:
    def rotate(self, nums: list[int], k: int) -> None:
        """
        Do not return anything, modify nums in-place instead.
        """
        def reverse(i: int, j: int) -> None:
            while i < j:                              # 双指针，翻转整个数组
                nums[i], nums[j] = nums[j], nums[i]   # 交换左右指针的元素
                i += 1                                # 左指针右移
                j -= 1                                # 右指针左移

        n = len(nums)
        k %= n                                        # 轮转 k 次等同于轮转 k % n 次，等价于 k = k % n
        reverse(0, n - 1)                             # 翻转整个数组
        reverse(0, k - 1)                             # 翻转前 k 个元素
        reverse(k, n - 1)                             # 翻转后 n-k 个元素

# 复杂度分析：
# 时间复杂度：O(n)，其中 n 是数组 nums 的长度。我们只需要对数组进行三次翻转，每次翻转的时间复杂度为 O(n)。
# 空间复杂度：O(1)，我们只需要常数空间来存储若干变量。

# 笔记：
# Python 的 % 有个特点：余数的符号跟着除数 n 走，而不是被除数 k：
# 7 % 3 = 1
# -7 % 3 = 2
# 7 % -3 = -2
# -7 % -3 = -1
