"""
给你一个整数数组 nums，返回 数组 answer ，其中 answer[i] 等于 nums 中除了 nums[i] 之外其余各元素的乘积 。
题目数据 保证 数组 nums之中任意元素的全部前缀元素和后缀的乘积都在  32 位 整数范围内。
请不要使用除法，且在 O(n) 时间复杂度内完成此题。

示例 1:
输入: nums = [1,2,3,4]
输出: [24,12,8,6]

示例 2:
输入: nums = [-1,1,0,-3,3]
输出: [0,0,9,0,0]
"""

# 最佳答案，前缀积和后缀积
class Solution:
    def productExceptSelf(self, nums: List[int]) -> List[int]:
        ans, tmp = [1] * len(nums), 1         # 初始化答案数组和临时变量
        for i in range(1, len(nums)):
            ans[i] = ans[i - 1] * nums[i - 1] # 下三角
        for i in range(len(nums) - 2, -1, -1):
            tmp *= nums[i + 1]                # 上三角
            ans[i] *= tmp                     # 下三角 * 上三角
        return ans

# 复杂度分析：
# 时间复杂度：O(n)，其中 n 是数组 nums 的长度。我们只需要对数组进行两次遍历。
# 空间复杂度：O(1)，不考虑返回值的空间占用，我们只需要常数空间来存储若干变量。

# 笔记：
# 什么是前缀积和后缀积？
# 前缀积：数组中每个元素的前缀积是指该元素之前所有元素的乘积。例如，数组 [1, 2, 3, 4] 的前缀积为 [1, 1, 2, 6]。
# 后缀积：数组中每个元素的后缀积是指该元素之后所有元素的乘积。例如，数组 [1, 2, 3, 4] 的后缀积为 [24, 12, 4, 1]。
# range() 函数的使用：
# range(start, stop, step) 函数用于生成一个整数序列，从 start 开始，到 stop 结束（不包括 stop），步长为 step。
# 例如：
# range(1, 5) 生成的序列为 [1, 2, 3, 4]